spec/spec/SVAP/AcquiringApplications/Examples/app_flow.example.2013.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:int="http://bpc.ru/sv/SVAP">
<soapenv:Header/>
<soapenv:Body>
<application xmlns="http://sv.bpc.in/SVAP">
    <application_type>APTPACQA</application_type>                                       <!-- Application type - Acquiring -->
    <application_flow_id>2013</application_flow_id>                                     <!-- Application flow (business process) - Change acquiring customer -->
    <application_status>APST0006</application_status>                                   <!-- Application status - Ready to process -->
    <operator_id>ADMIN</operator_id>                                                	<!-- User name who made this application -->
    <institution_id>1001</institution_id>                                               <!-- Institution identifier -->
    <agent_id>10000001</agent_id>                                                       <!-- Agent identifier -->
    <customer>
        <command>CMMDEXUP</command>                                                     <!-- Command for customer - raise error or update -->
        <customer_number>0000000000000000000697</customer_number>                       <!-- Unique customer number -->
        <customer_category>CCTGORDN</customer_category>                                 <!-- Customer category - ordinary customer -->
        <customer_relation>RSCBEXTR</customer_relation>                                 <!-- Customer and bank additional relation - No relation -->
        <account_scheme>2</account_scheme>
        <resident>1</resident>                                                          <!-- Resident flag -->
        <nationality>643</nationality>                                                  <!-- Customer nationality -->
        <company>                                                                       <!-- Person data -->
            <command>CMMDEXUP</command>                                                 <!-- Command for person - Create new or update if exists -->
            <incorp_form>INCF0065</incorp_form>                                         <!-- Incorporation form - Limited liability company -->
            <company_name language="LANGENG">                                           <!-- Company name. Attribute LANGUAGE contain code of language of provided company name - English -->
                <company_short_name>Food N Drinks Inc</company_short_name>              <!-- Company short name -->
                <company_full_name>Food N Drinks Incorporation</company_full_name>      <!-- Company full name -->
            </company_name>
            <identity_card>                                                             <!-- Identity card data -->
                <command>CMMDEXUP</command>                                             <!-- Command for identity card - Create new or update if exists -->
                <id_type>IDTP0010</id_type>                                             <!-- Identity card type - Taxpayer Identification Number -->
                <id_number>1234567890</id_number>                                       <!-- Taxpayer Identification Number -->
            </identity_card>
        </company>
        <contact>                                                                       <!-- Contact -->
            <command>CMMDEXUP</command>                                                 <!-- Command for contact - Create new or update if exists -->
            <contact_type>CNTTPRMC</contact_type>                                       <!-- Contact type - Primary -->
            <preferred_lang>LANGENG</preferred_lang>                                    <!-- Preferred language of speaking -->
            <contact_data>
                <commun_method>CMNM0001</commun_method>                                 <!-- Communication method - Mobile phone -->
                <commun_address>04728428779</commun_address>                            <!-- Communication address - Mobile phone number -->
            </contact_data>
        </contact>
        <address>                                                                       <!-- Address -->
            <command>CMMDEXUP</command>                                                 <!-- Command for address - Create new or update if exists -->
            <address_type>ADTPHOME</address_type>                                       <!-- Address type - Home address -->
            <country>643</country>                                                      <!-- Country ISO code - Russia -->
            <address_name language="LANGENG">                                           <!-- Address. Attribute LANGUAGE contain code of language of provided address - English -->
                <region>Moscow</region>                                                 <!-- Region name -->
                <city>Moscow</city>                                                     <!-- Name of city -->
                <street>Street 3</street>                                               <!-- Street -->
            </address_name>
            <house>17</house>                                                           <!-- House number -->
            <apartment>10</apartment>                                                   <!-- Appartment number -->
        </address>
        <contract>
            <command>CMMDEXPR</command>                                                 <!-- Command for contract - Create new or raise error -->
            <contract_type>CNTPMRCM</contract_type>                                     <!-- Contract type - Personal cards -->
            <product_id>2</product_id>                                                  <!-- Product identifier -->
            <contract_number>00000000000000000000000000000736</contract_number>         <!-- Contract number -->
            <start_date>2013-01-23</start_date>                                         <!-- Date when contract was signed -->            
        </contract>
    </customer>
</application>
</soapenv:Body>
</soapenv:Envelope>
